app/Controllers/ProdukController.php

    public function create()
    {
        $data = [
            'kode_produk' => $this->request->getVar('kode_produk'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'harga' => $this->request->getVar('harga')
        ];

        $model = new MProduk();
        $model->insert($data);
        $produk = $model->find($model->getInsertID());
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('A001', 'Realme Smart TV 50 Inch', 57000000)
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1

    public function list()
    {
        $model = new MProduk();
        $produk = $model->findAll();
---
SELECT *
FROM `produk`

    public function ubah($id)
    {
        $data = [
            'kode_produk' => $this->request->getVar('kode_produk'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'harga' => $this->request->getVar('harga')
        ];

        $model = new MProduk();

        if (!$model->find($id)) {
            return $this->failNotFound("Produk dengan ID $id tidak ditemukan");
        }

        $model->update($id, $data);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'
UPDATE `produk` SET `kode_produk` = 'A001', `nama_produk` = 'Realme Smart TV 50 Inch', `harga` = 57000000
WHERE `produk`.`id` IN ('1')

    public function hapus($id)
    {
        $model = new MProduk();

        if (!$model->find($id)) {
            return $this->failNotFound("Produk dengan ID $id tidak ditemukan");
        }

        $model->delete($id);
---
DELETE FROM `produk`
WHERE `id` IN ('2')